app/controllers/comments_controller.rb

	def index
		comments = @commentable.comments.all
		render json: comments.paginate(page: params[:page]).per_page(params[:per_page]), status: :ok
---
SELECT "comments".* FROM "comments"

	def show #this is useless, do not works
		comment = @commentable.comments.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		comment = @commentable.comments.new(comment_params)
		comment.user_id = current_user.id
		comment.save
---
INSERT INTO "comments" ("user_id", "commentable_type", "commentable_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def update
		comment = @commentable.comments.find(params[:id])
		if comment.user_id == current_user.id
			if comment.update(comment_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "C MAMUT +10 PAPU"], ["updated_at", "2019-05-17 23:48:21.197697"], ["id", 27]]

	def destroy
		comment = @commentable.comments.find(params[:id])
		if comment.user_id == current_user.id
			comment.destroy
			if comment.destroyed?
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 27]]