app/controllers/memes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "memes".* FROM "memes" WHERE "memes"."user_id" = ?  [["user_id", 1]]
SELECT "memes".* FROM "memes"
---
    def index
        #shouldn't be necessary due to shallow paths
        if params[:user_id]
            user = User.find(params[:user_id])
            memes = user.memes.all
        else
            memes = Meme.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "memes".* FROM "memes" WHERE "memes"."user_id" = ? AND "memes"."id" = ? LIMIT ?  [["user_id", 6], ["id", 6], ["LIMIT", 1]]
SELECT  "memes".* FROM "memes" WHERE "memes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        if params[:user_id]
            user = User.find(params[:user_id])
            meme = user.memes.find(params[:id])
        else
            meme = Meme.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "memes" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 4], ["created_at", "2019-05-18 00:15:10.961793"], ["updated_at", "2019-05-18 00:15:10.961793"]]
INSERT INTO "pictures" ("image", "imageable_type", "imageable_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["image", "<101 bytes of binary data>"], ["imageable_type", "Meme"], ["imageable_id", 16], ["created_at", "2019-05-18 00:15:10.964180"], ["updated_at", "2019-05-18 00:15:10.964180"]]
---
    def create
        user = User.find(params[:user_id])
        meme = user.memes.create(
            picture: Picture.create(
                image: meme_params[:picture_image]
            )
        )

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "memes".* FROM "memes" WHERE "memes"."user_id" = ? AND "memes"."id" = ? LIMIT ?  [["user_id", 6], ["id", 6], ["LIMIT", 1]]
DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 6]]
INSERT INTO "pictures" ("image", "imageable_type", "imageable_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["image", "<59 bytes of binary data>"], ["imageable_type", "Meme"], ["imageable_id", 6], ["created_at", "2019-05-18 00:54:01.644007"], ["updated_at", "2019-05-18 00:54:01.644007"]]
---
    def update
        user = User.find(params[:user_id])
        meme = user.memes.find(params[:id])
        meme.picture.destroy

        if meme.picture.destroyed?
            valid = meme.update(
                picture: Picture.create(
                    image: meme_params[:picture_image]
                )
            )

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "memes".* FROM "memes" WHERE "memes"."user_id" = ? AND "memes"."id" = ? LIMIT ?  [["user_id", 6], ["id", 6], ["LIMIT", 1]]
DELETE FROM "post_memes" WHERE "post_memes"."id" = ?  [["id", 3]]
---
    def destroy
        user = User.find(params[:user_id])
        meme = user.memes.find(params[:id])
        meme.destroy