app/controllers/pictures_controller.rb

SELECT "pictures".* FROM "pictures"
---
    def index
		if @imageable
            images = @imageable.picture
		else
			images = Picture.all