app/controllers/post_memes_controller.rb

	def index
		post_memes = PostMeme.all
---
SELECT "post_memes".* FROM "post_memes"