app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT "posts".* FROM "posts"
---
    def index
        if params[:user_id]
            user = User.find(params[:user_id])
            posts = user.posts.all
        else
            posts = Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
    def show
        # We just require post Id.
        post = Post.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "posts" ("user_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["body", "Este es el mejor post que veras hoy :D"], ["created_at", "2019-05-18 01:02:33.997983"], ["updated_at", "2019-05-18 01:02:33.997983"]]
---
    def create
        user = User.find(params[:user_id])
        post = user.create(post_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 2], ["id", 16], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "Este es el segundo mejor post, la precuela xd"], ["updated_at", "2019-05-18 01:04:36.347752"], ["id", 16]]
---
    def update
        user = User.find(params[:user_id])
        post = user.posts.find(params[:id])
        if post.update(post_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 2], ["id", 16], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 16]]
---
    def destroy
        user = User.find(params[:user_id])
        post = user.posts.find(params[:id])
        post.destroy()