app/controllers/reactions_controller.rb

	def index
		puts( @reactionable.class )

		if @reactionable
			reactions = @reactionable.reactions.all
		else
			reactions = Reaction.all
---
SELECT "reactions".* FROM "reactions"

	def show
		reaction = Reaction.find(params[:id])
---
SELECT  "reactions".* FROM "reactions" WHERE "reactions"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]

	def create
		user = User.find(params[:user_id])
		reaction = user.reactions.create(reaction_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "reactions" ("user_id", "meme_id", "reaction_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 7], ["meme_id", 7], ["reaction_type", 4], ["created_at", "2019-05-18 01:34:51.224050"], ["updated_at", "2019-05-18 01:34:51.224050"]]

	def update
		user = User.find(params[:user_id])
		reaction = user.reactions.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "reactions".* FROM "reactions" WHERE "reactions"."user_id" = ? AND "reactions"."id" = ? LIMIT ?  [["user_id", 7], ["id", 7], ["LIMIT", 1]]

	def destroy
		user = User.find(params[:user_id])
		reaction = user.reactions.find(params[:id])
		reaction.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT  "reactions".* FROM "reactions" WHERE "reactions"."user_id" = ? AND "reactions"."id" = ? LIMIT ?  [["user_id", 7], ["id", 14], ["LIMIT", 1]]
DELETE FROM "reactions" WHERE "reactions"."id" = ?  [["id", 14]]