app/controllers/reactions_controller.rb

	def update
		reaction = current_user.reactions.find(params[:id])
---
SELECT "reactions".* FROM "reactions" WHERE "reactions"."user_id" = ?  [["user_id", 10]]