app/controllers/templates_controller.rb

SELECT "templates".* FROM "templates"
---
    def index
        template = Template.all