app/controllers/users_controller.rb

INSERT INTO "users" ("handle", "age", "pass", "password_salt", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["handle", "JhonnyZaz"], ["age", 20], ["pass", "AJSLKJG97879W"], ["password_salt", "KJLQPXZ4XF987"], ["created_at", "2019-05-17 22:47:55.893157"], ["updated_at", "2019-05-17 22:47:55.893157"]]
---
    def create
        user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "handle" = ?, "age" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["handle", "jonathan98zaz"], ["age", 18], ["updated_at", "2019-05-17 22:51:21.492820"], ["id", 1]]
---
    def update
        user = User.find(params[:id])
        user.avatar.purge if user.avatar.attached?

        if user.update(user_params)